# Name Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElement..::..Name Property
SpatialElement Class See Also
---
A human readable name for the Element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override string Name { set; }
```

Visual Basic
---
```text
Public Overrides WriteOnly Property Name As String
	Set
```

Visual C++
---
```text
public:
virtual property String^ Name {
	void set (String^ value) override;
}
```

# Remarks
The Name property is a human readable name for the element, such as Wall.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the name of the element cannot be changed. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the element requires a unique name and a non-unique name is set. |

# See Also
SpatialElement Class
Autodesk.Revit.DB Namespace